app/api/blog/v1/users.rb

        route_param :id do
          get do
            authenticate!
            UserSerializer.new(User.find(params[:id]))
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

          options = {}
          options[:meta] = { total: total, page: page }

          UserSerializer.new(User.page(page).per(total), options)
---
SELECT "users".* FROM "users" LIMIT $1 OFFSET $2  [["LIMIT", 20], ["OFFSET", 20]]

        post 'login' do
          email = params[:email]
          password = params[:password]
          user = User.find_by!(email: email)
---
SELECT "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "111@111"], ["LIMIT", 1]]