rails/app/api/blog/v1/posts.rb

        route_param :id do
          desc 'Return post info'
          get do
            PostSerializer.new(Post.find(params[:id]))
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]